#用字典创建员工薪酬表
dict_0 = {
    "王力宏":{
        "部门":"科技部",
        "工资":3000,
        "级别":1},
    "周杰伦":{
        "部门":"市场部",
        "工资":5000,
        "级别":2},
    "林俊杰":{
        "部门":"市场部",
        "工资":"7000",
        "级别":3},
    "张学友":{
        "部门":"科技部",
        "工资":4000,
        "级别":1}
}
print(f"修改前的薪酬为：{dict_0}")
#for循环遍历字典
for name in dict_0:
    #判断是否符合要求
    if dict_0[name]["级别"]== 1:
        dict_0[name]["级别"] += 1
        dict_0[name]["工资"] += 1000
#输出结果
print(f"修改后的薪酬为：{dict_0}")


